# Compound Structure Get Layer Width Method

Source: https://www.revitapidocs.com/2026/47ba99b2-d633-bcc7-f9a7-fe6c00bc5af0.htm

---

| Compound Structure Get Layer Width Method |
| --- |

Retrieves the width of a specified layer.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetLayerWidth(
	int layerIdx
)
```

```
Public Function GetLayerWidth (
	layerIdx As Integer
) As Double
```

```
public:
double GetLayerWidth(
	int layerIdx
)
```

```
member GetLayerWidth :
        layerIdx : int -> float
```

#### Parameters

layerIdx Int32
:   Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.

#### Return Value

Double
The width of the specified layer. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The layer index is out of range. |

See Also

#### Reference

CompoundStructure Class Autodesk.Revit.DB Namespace